000100150506     /* ?**********************************************************? */
000200160513     /* ?SOURCE       -  JETCSVWRK2                                ? */
000300150506     /* ?PROGRAMMER   -  Jim Engle - Tree Line Data, LLC           ? */
000400160513     /* ?DATE         -  05-13-2016                                ? */
000500160513     /* ?COMMENTS     -  CSV SKU import from Website download      ? */
000600150506     /* ?**********************************************************? */
000700150506     /* ?                MODIFICATIONS                             ? */
000800150506     /* ?**********************************************************? */
000900150506     /* ?Date       Init Description                               ? */
001000150506     /* ?---------- ---- ----------------------------------------  ? */
001100160513     /* ?05/13/16   JimE Created file                              ? */
001200150506     /* ?**********************************************************? */
001300160513     A          R JETCSVWK2R
001400080706
001500160413     A            SKU           30A         TEXT('SKU')
001600160513     A            TITLE        500A         TEXT('SKU Title')
001700160513     A            STATUS        50A         TEXT('SKU Status')
001800160513     A            SUBSTATUS    200A         TEXT('SKU Sub-Status')
001900160513     A            INVYESNO       3A         TEXT('Has Inventory Yes/No')
007000160128
007100160413     A          K SKU
007200160322     A*
