000100160610     A          R JETCSVWKJR
000200080706
000300160413     A            SKU           30A         TEXT('SKU')
000400160318     A            ITMNAME      500A         TEXT('ITEM NAME')
000500160318     A            BROWSID       11A         TEXT('BROWSER NODE ID')
000600160318     A            ITMTYPE      100A         TEXT('ITEM TYPE KEYWORD')
000700160318     A            CATPATH      100A         TEXT('CATEGORY PATH')
000800160318     A            UPCCODE       14A         TEXT('UPC CODE')
000900160128     A            ASIN          25A         TEXT('ASIN')
001000160318     A            PKGQTY         9A         TEXT('PACKAGE QTY')
001100160128     A            BRAND         50A         TEXT('BRAND NAME')
001200160128     A            MFG           50A         TEXT('MANUFACTURER')
001300160128     A            MFGPART       50A         TEXT('MANUFACTURER PART#')
001400160128     A            ITMDESC     2000A         TEXT('ITEM DESC')
001500160128     A            BULLET1      500A         TEXT('BULLET 1')
001600160128     A            BULLET2      500A         TEXT('BULLET 2')
001700160128     A            BULLET3      500A         TEXT('BULLET 3')
001800160128     A            BULLET4      500A         TEXT('BULLET 4')
001900160128     A            BULLET5      500A         TEXT('BULLET 5')
002000160318     A            NBRUNTS        9A         TEXT('NBR UNITS')
002100160128     A            UOM           15A         TEXT('UNIT OF MEASURE')
002200160318     A            SHPWEIGHT     11A         TEXT('SHIPPING WEIGHT')
002300160318     A            PDLENGTH      11A         TEXT('PCK DIM LENGTH')
002400160318     A            PDWIDTH       11A         TEXT('PCK DIM WIDTH')
002500160318     A            PDHEIGHT      11A         TEXT('PCK DIM HEIGHT')
002600160318     A            DSLENGTH      11A         TEXT('DISPLAY LENGTH')
002700160318     A            DSWIDTH       11A         TEXT('DISPLAY WIDTH')
002800160318     A            DSHEIGHT      11A         TEXT('DISPLAY HEIGHT')
002900160128     A            PROP65         5A         TEXT('PROP 65 TRUE/FALSE')
003000160128     A            LGLDISCL     500A         TEXT('LEGAL DISCLAIMER')
003100160128     A            CAUTION       50A         TEXT('CAUTIONARY STATEMENTS')
003200160128     A            COO           50A         TEXT('COUNTRY OF ORIGIN')
003300160128     A            SAFTYWARN    500A         TEXT('SAFETY WARNING')
003400160128     A            STRDATE       40A         TEXT('START SELLING DATE')
003500160318     A            DAYSTOSHIP     2A         TEXT('DAYS TO SHIP')
003600160318     A            PRICE         11A         TEXT('PRICE')
003700160318     A            MAPPRICE       9A         TEXT('MAP-PRICE')
003800160128     A            MAPIMPL        5A         TEXT('MAP-IMPLEMENTATION')
003900160128     A            TAXCODE       30A         TEXT('TAX CODE')
004000160318     A            NOFEEADJ       3A         TEXT('NO FEE ADJUSTMENT')
004100160128     A            EXCLFEE        5A         TEXT('EXCLUDE FEE ADJ TRUE/FALSE')
004200160128     A            SHPALONE       5A         TEXT('SHIPS ALONE TRUE/FALSE')
004300160318     A            ATRNODSPEC    10A         TEXT('ATTRIBUTES NODE SPECIFIC')
004400160318     A            ATTRID1        7A         TEXT('ATTRIBUTE ID1')
004500160318     A            ATTRVAL1      50A         TEXT('ATTRIBUTE VALUE1')
004600160318     A            ATTRUNIT1     25A         TEXT('ATTRIBUTE UNIT1')
004700160318     A            ATTRID2        7A         TEXT('ATTRIBUTE ID2')
004800160318     A            ATTRVAL2      50A         TEXT('ATTRIBUTE VALUE2')
004900160318     A            ATTRUNIT2     25A         TEXT('ATTRIBUTE UNIT2')
005000160318     A            ATTRID3        7A         TEXT('ATTRIBUTE ID3')
005100160318     A            ATTRVAL3      50A         TEXT('ATTRIBUTE VALUE3')
005200160318     A            ATTRUNIT3     25A         TEXT('ATTRIBUTE UNIT3')
005300160128     A            MAINIMGURL   500A         TEXT('MAIN IMAGE URL')
005400160128     A            SWCHIMGURL   500A         TEXT('SWATCH IMAGE URL')
005500160318     A            OTHIMGURL1   500A         TEXT('OTHER IMAGE URL1')
005600160318     A            OTHIMGURL2   500A         TEXT('OTHER IMAGE URL2')
005700160318     A            OTHIMGURL3   500A         TEXT('OTHER IMAGE URL3')
005800160128
005900160413     A          K SKU
006000160322     A*
